package CollectionOther.OnSolomaLesson;

/*  ТИПЫ ДАННЫХ
    1) список
    .size() // скбки тк просто метод,но реализованный в джава
   .get(i)    .set(i, j)

   2) множества - набор эл   (используем обычно там где лишь важно наличие или отсутствие эл)
   индексации нет,   могут быть упорядоченный могу быть нет
   {A, B, C, D}

   3)Словари  (ассоциативный массив, Map, хеш-таблицы и тд) - речь о словаре
    пары ключ - значение
    {
    key1:value1,
    key1:value1,
    ...
    }
    запись по ключу, обращение по ключу

    4)Стек

    5) Очередь

    6) Двунаправленная очередь

 */

public class Soloma {
}
