package CollectionOther.OnSolomaLesson.Hard;
/*
СЛОЖНОСТЬ АЛГОРИТМА - колич характеристика ресов необходимая алгоритму для решения задачи

модель вычислений ram (некий обстрактный вычислитель) для которого:
 - исполнение простой операции (+ - = if сall) - один временной шаг
 - циклы и подрограммы - из нескольких простых операций
 - каждое обращение к памяти (на чтение или запись) - один временной шаг

 есть таблица сложности на фотке
 если в цикле у ел есть и своя сложность то умножаем
 */
public class One {

}
